Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/concurrent-mode-patterns_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: Even though there is an improvement in responsiveness, this example isn't as compelling yet because Concurrent Mode is missing some crucial optimizations for this use case.
ja: レスポンシブ性という点で改善点は得られましたが、並列モードにはこのユースケースにおける重要な最適化のいくつかが欠けており、そのため今回の例はそれほど魅力的ではありません。

source: Still, it is interesting to see that features like `useDeferredValue` (or `useTransition`) are useful regardless of whether we're waiting for network or for computational work to finish.
ja: それでも、`useDeferredValue`（や `useTransition`）のような機能が、ネットワークの完了を待機しているのか計算の完了を待機しているのかに関わらず有用である、というのは興味深い事実です。

source: `<SuspenseList>` is the last pattern that's related to orchestrating loading states.
ja: `<SuspenseList>` が、ローディング中状態の制御に関する最後のパターンです。

source: Consider this example:
ja: 以下の例を考えてください：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/proud-tree-exg5t)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/proud-tree-exg5t)**

source: The API call duration in this example is randomized.
ja: この例での API のコール時間はランダム化されています。

source: If you keep refreshing it, you will notice that sometimes the posts arrive first, and sometimes the "fun facts" arrive first.
ja: 再読み込みを繰り返すと、タイムライン投稿が先に来ることもあれば「豆知識」が先に来る場合もあることに気付くでしょう。

source: This presents a problem.
ja: ここで問題が起こります。

source: If the response for fun facts arrives first, we'll see the fun facts below the `Loading posts...` fallback for posts.
ja: もし豆知識のレスポンスが先に来た場合、`Loading posts...` というフォールバックの下方に豆知識が表示されることになります。

source: We might start reading them, but then the *posts* response will come back, and shift all the facts down.
ja: 豆知識を読み始めた瞬間に*投稿の*レスポンスが返ってきて、豆知識が下側にずれてしまいます。

source: This is jarring.
ja: これは煩わしいでしょう。

source: One way we could fix it is by putting them both in a single boundary:
ja: これを修正する 1 つの方法は、両方を単一のバウンダリに入れることです：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/currying-violet-5jsiy)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/currying-violet-5jsiy)**

source: The problem with this is that now we *always* wait for both of them to be fetched.
ja: この方法の問題は、*常に*両方が取得されるまで待つようになったことです。

source: However, if it's the *posts* that came back first, there's no reason to delay showing them.
ja: もし*投稿*の方が先に返ってきたなら、それを表示するのを遅らせる理由はありません。

source: When fun facts load later, they won't shift the layout because they're already below the posts.
ja: 豆知識が後で返ってきても、それは既に投稿の下側にあるのですから、レイアウトのずれを発生させません。

source: Other approaches to this, such as composing Promises in a special way, are increasingly difficult to pull off when the loading states are located in different components down the tree.
ja: Promise を特殊な方法で合成するといった、この問題に対する他のアプローチは、ツリー内の様々なコンポーネントにロード中状態が存在するようになると徐々にうまく行かなくなります。

source: To solve this, we will import `SuspenseList`:
ja: これを解決するため、`SuspenseList` をインポートしましょう：

source: `<SuspenseList>` coordinates the "reveal order" of the closest `<Suspense>` nodes below it:
ja: `<SuspenseList>` は、配下にある直近の `<Suspense>` ノードの「開放順序」を制御します：

source: **[Try it on CodeSandbox](https://codesandbox.io/s/black-wind-byilt)**
ja: **[CodeSandbox で試す](https://codesandbox.io/s/black-wind-byilt)**

source: The `revealOrder="forwards"` option means that the closest `<Suspense>` nodes inside this list **will only "reveal" their content in the order they appear in the tree -- even if the data for them arrives in a different order**.
ja: `revealOrder="forwards"` というオプションは、このリスト内部にある直近の `<Suspense>` ノードは、**データが異なった順番で到着した場合でも、ツリーに現れる順番でしか「開放」されない**ということを意味します。`<SuspenseList>` には他にも興味深いモードがあります。

source: `<SuspenseList>` has other interesting modes: try changing `"forwards"` to `"backwards"` or `"together"` and see what happens.
ja: `"forwards"` を `"backwards"` や `"together"` に変えてみて、何が起こるか確認してください。

source: You can control how many loading states are visible at once with the `tail` prop.
ja: `tail` プロパティを使って同時に表示されるローディング中状態の数を制御することができます。

source: If we specify `tail="collapsed"`, we'll see *at most one* fallback at a time.
ja: `tail="collapsed"` と指定すると、同時に*最大でも 1 つ*しかフォールバックが表示されないようになります。

source: You can play with it [here](https://codesandbox.io/s/adoring-almeida-1zzjh).
ja: [こちら](https://codesandbox.io/s/adoring-almeida-1zzjh)で試すことができます。

source: Keep in mind that `<SuspenseList>` is composable, like anything in React.
ja: React の他のあらゆるものと同様に、`<SuspenseList>` は合成可能であることを覚えておいてください。

source: For example, you can create a grid by putting several `<SuspenseList>` rows inside a `<SuspenseList>` table.
ja: 例えば、`<SuspenseList>` の行を `<SuspenseList>` のテーブル内に入れてグリッドを作ることができます。

source: ## Next Steps {#next-steps}
ja: ## 次のステップ {#next-steps}

source: Concurrent Mode offers a powerful UI programming model and a set of new composable primitives to help you orchestrate delightful user experiences.
ja: 並列モードは、快適なユーザ体験を組み上げるためのパワフルな UI プログラミングモデルと、合成可能な新たな基本要素群を提供します。

source: It's a result of several years of research and development, but it's not finished.
ja: これは数年にわたる研究と開発の成果ですが、まだ完成していません。

source: In the section on [adopting Concurrent Mode](/docs/concurrent-mode-adoption.html), we'll describe how you can try it and what you can expect.
ja: [並列モードの利用開始](/docs/concurrent-mode-adoption.html)についてのセクションで、並列モードを試す方法や期待されることについて解説します。
